app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

    def set_location
      @location = Location.find(params[:id])
---
SELECT "locations".* FROM "locations" WHERE "locations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]